app/controllers/api/events_controller.rb

SELECT  "events".* FROM "events" LIMIT 20 OFFSET 0
---
  def index
    events = Event.limit(@limit).offset(@offset)