app/controllers/api/users_controller.rb

  def index
    users = User.limit(@limit).offset(@offset).includes(:event)
---
SELECT "events".* FROM "events" WHERE "events"."id" IN (NULL)
SELECT DISTINCT COUNT(DISTINCT "users"."id") FROM "users"